The Macro language type.
  Namespace:   Autodesk.Revit.DB.Macros
  Assembly:   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public MacroLanguageType MacroLanguageType { get; }
  Visual Basic
Public ReadOnly Property MacroLanguageType As MacroLanguageType
	Get
  Visual C++
public:
property MacroLanguageType MacroLanguageType {
	MacroLanguageType get ();
}
 See Also
  MacroModule Class
  Autodesk.Revit.DB.Macros Namespace